app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE 1=0 ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    if params[:sort] == "release_date"
      @movies = Movie.find(:all, :order => "release_date")
    elsif params[:sort] == "title"
      @movies = Movie.find(:all, :order => "title")
    else
      @movies = Movie.all